Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEmem_bf.h
/**
 * \file IfxEmem_bf.h
 * \brief
 * \copyright Copyright (c) 2019 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC39XB_UM_V1.1.0.R0
 * Specification: TC3xx User Manual V1.1.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Emem_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Emem_Registers
 * 
 */
#ifndef IFXEMEM_BF_H
#define IFXEMEM_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Emem_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_EMEM_CLC_Bits.DISR */
#define IFX_EMEM_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_EMEM_CLC_Bits.DISR */
#define IFX_EMEM_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_CLC_Bits.DISR */
#define IFX_EMEM_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_EMEM_CLC_Bits.DISS */
#define IFX_EMEM_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_EMEM_CLC_Bits.DISS */
#define IFX_EMEM_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_CLC_Bits.DISS */
#define IFX_EMEM_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_EMEM_ID_Bits.MOD_REV */
#define IFX_EMEM_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_EMEM_ID_Bits.MOD_REV */
#define IFX_EMEM_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_EMEM_ID_Bits.MOD_REV */
#define IFX_EMEM_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_EMEM_ID_Bits.MOD_TYPE */
#define IFX_EMEM_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_EMEM_ID_Bits.MOD_TYPE */
#define IFX_EMEM_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_EMEM_ID_Bits.MOD_TYPE */
#define IFX_EMEM_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_EMEM_ID_Bits.MOD_NUM */
#define IFX_EMEM_ID_MOD_NUM_LEN (16u)

/** \brief Mask for Ifx_EMEM_ID_Bits.MOD_NUM */
#define IFX_EMEM_ID_MOD_NUM_MSK (0xffffu)

/** \brief Offset for Ifx_EMEM_ID_Bits.MOD_NUM */
#define IFX_EMEM_ID_MOD_NUM_OFF (16u)

/** \brief Length for Ifx_EMEM_TILECONFIG_Bits.TCM0 */
#define IFX_EMEM_TILECONFIG_TCM0_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILECONFIG_Bits.TCM0 */
#define IFX_EMEM_TILECONFIG_TCM0_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILECONFIG_Bits.TCM0 */
#define IFX_EMEM_TILECONFIG_TCM0_OFF (0u)

/** \brief Length for Ifx_EMEM_TILECONFIG_Bits.TCM1 */
#define IFX_EMEM_TILECONFIG_TCM1_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILECONFIG_Bits.TCM1 */
#define IFX_EMEM_TILECONFIG_TCM1_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILECONFIG_Bits.TCM1 */
#define IFX_EMEM_TILECONFIG_TCM1_OFF (2u)

/** \brief Length for Ifx_EMEM_TILECONFIG_Bits.TCM2 */
#define IFX_EMEM_TILECONFIG_TCM2_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILECONFIG_Bits.TCM2 */
#define IFX_EMEM_TILECONFIG_TCM2_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILECONFIG_Bits.TCM2 */
#define IFX_EMEM_TILECONFIG_TCM2_OFF (4u)

/** \brief Length for Ifx_EMEM_TILECONFIG_Bits.TCM3 */
#define IFX_EMEM_TILECONFIG_TCM3_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILECONFIG_Bits.TCM3 */
#define IFX_EMEM_TILECONFIG_TCM3_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILECONFIG_Bits.TCM3 */
#define IFX_EMEM_TILECONFIG_TCM3_OFF (6u)

/** \brief Length for Ifx_EMEM_TILECONFIG_Bits.TCM4 */
#define IFX_EMEM_TILECONFIG_TCM4_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILECONFIG_Bits.TCM4 */
#define IFX_EMEM_TILECONFIG_TCM4_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILECONFIG_Bits.TCM4 */
#define IFX_EMEM_TILECONFIG_TCM4_OFF (8u)

/** \brief Length for Ifx_EMEM_TILECONFIG_Bits.TCM5 */
#define IFX_EMEM_TILECONFIG_TCM5_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILECONFIG_Bits.TCM5 */
#define IFX_EMEM_TILECONFIG_TCM5_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILECONFIG_Bits.TCM5 */
#define IFX_EMEM_TILECONFIG_TCM5_OFF (10u)

/** \brief Length for Ifx_EMEM_TILECONFIG_Bits.TCM6 */
#define IFX_EMEM_TILECONFIG_TCM6_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILECONFIG_Bits.TCM6 */
#define IFX_EMEM_TILECONFIG_TCM6_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILECONFIG_Bits.TCM6 */
#define IFX_EMEM_TILECONFIG_TCM6_OFF (12u)

/** \brief Length for Ifx_EMEM_TILECONFIG_Bits.TCM7 */
#define IFX_EMEM_TILECONFIG_TCM7_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILECONFIG_Bits.TCM7 */
#define IFX_EMEM_TILECONFIG_TCM7_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILECONFIG_Bits.TCM7 */
#define IFX_EMEM_TILECONFIG_TCM7_OFF (14u)

