Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEmem_bf.h
/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM5 */
#define IFX_EMEM_TILECC_XCM5_OFF (13u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM6 */
#define IFX_EMEM_TILECC_XCM6_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM6 */
#define IFX_EMEM_TILECC_XCM6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM6 */
#define IFX_EMEM_TILECC_XCM6_OFF (14u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM7 */
#define IFX_EMEM_TILECC_XCM7_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM7 */
#define IFX_EMEM_TILECC_XCM7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM7 */
#define IFX_EMEM_TILECC_XCM7_OFF (15u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM0 */
#define IFX_EMEM_TILECT_TCM0_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM0 */
#define IFX_EMEM_TILECT_TCM0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM0 */
#define IFX_EMEM_TILECT_TCM0_OFF (0u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM1 */
#define IFX_EMEM_TILECT_TCM1_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM1 */
#define IFX_EMEM_TILECT_TCM1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM1 */
#define IFX_EMEM_TILECT_TCM1_OFF (1u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM2 */
#define IFX_EMEM_TILECT_TCM2_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM2 */
#define IFX_EMEM_TILECT_TCM2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM2 */
#define IFX_EMEM_TILECT_TCM2_OFF (2u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM3 */
#define IFX_EMEM_TILECT_TCM3_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM3 */
#define IFX_EMEM_TILECT_TCM3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM3 */
#define IFX_EMEM_TILECT_TCM3_OFF (3u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM4 */
#define IFX_EMEM_TILECT_TCM4_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM4 */
#define IFX_EMEM_TILECT_TCM4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM4 */
#define IFX_EMEM_TILECT_TCM4_OFF (4u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM5 */
#define IFX_EMEM_TILECT_TCM5_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM5 */
#define IFX_EMEM_TILECT_TCM5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM5 */
#define IFX_EMEM_TILECT_TCM5_OFF (5u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM6 */
#define IFX_EMEM_TILECT_TCM6_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM6 */
#define IFX_EMEM_TILECT_TCM6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM6 */
#define IFX_EMEM_TILECT_TCM6_OFF (6u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM7 */
#define IFX_EMEM_TILECT_TCM7_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM7 */
#define IFX_EMEM_TILECT_TCM7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM7 */
#define IFX_EMEM_TILECT_TCM7_OFF (7u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.XTM0 */
#define IFX_EMEM_TILECT_XTM0_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.XTM0 */
#define IFX_EMEM_TILECT_XTM0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.XTM0 */
#define IFX_EMEM_TILECT_XTM0_OFF (16u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.XTM1 */
#define IFX_EMEM_TILECT_XTM1_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.XTM1 */
#define IFX_EMEM_TILECT_XTM1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.XTM1 */
#define IFX_EMEM_TILECT_XTM1_OFF (17u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM0 */
#define IFX_EMEM_TILESTATE_TCM0_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM0 */
#define IFX_EMEM_TILESTATE_TCM0_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM0 */
#define IFX_EMEM_TILESTATE_TCM0_OFF (0u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM1 */
#define IFX_EMEM_TILESTATE_TCM1_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM1 */
#define IFX_EMEM_TILESTATE_TCM1_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM1 */
#define IFX_EMEM_TILESTATE_TCM1_OFF (2u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM2 */
#define IFX_EMEM_TILESTATE_TCM2_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM2 */
#define IFX_EMEM_TILESTATE_TCM2_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM2 */
#define IFX_EMEM_TILESTATE_TCM2_OFF (4u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM3 */
#define IFX_EMEM_TILESTATE_TCM3_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM3 */
#define IFX_EMEM_TILESTATE_TCM3_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM3 */
#define IFX_EMEM_TILESTATE_TCM3_OFF (6u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM4 */
#define IFX_EMEM_TILESTATE_TCM4_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM4 */
#define IFX_EMEM_TILESTATE_TCM4_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM4 */
#define IFX_EMEM_TILESTATE_TCM4_OFF (8u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM5 */
#define IFX_EMEM_TILESTATE_TCM5_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM5 */
#define IFX_EMEM_TILESTATE_TCM5_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM5 */
#define IFX_EMEM_TILESTATE_TCM5_OFF (10u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM6 */
#define IFX_EMEM_TILESTATE_TCM6_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM6 */
#define IFX_EMEM_TILESTATE_TCM6_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM6 */
#define IFX_EMEM_TILESTATE_TCM6_OFF (12u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM7 */
#define IFX_EMEM_TILESTATE_TCM7_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM7 */
#define IFX_EMEM_TILESTATE_TCM7_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM7 */
#define IFX_EMEM_TILESTATE_TCM7_OFF (14u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.XCM0 */
#define IFX_EMEM_TILESTATE_XCM0_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.XCM0 */
#define IFX_EMEM_TILESTATE_XCM0_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.XCM0 */
#define IFX_EMEM_TILESTATE_XCM0_OFF (16u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.XCM1 */
#define IFX_EMEM_TILESTATE_XCM1_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.XCM1 */
#define IFX_EMEM_TILESTATE_XCM1_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.XCM1 */
#define IFX_EMEM_TILESTATE_XCM1_OFF (18u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.XCM2 */
#define IFX_EMEM_TILESTATE_XCM2_LEN (2u)

