Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEmem_bf.h
/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.XCM2 */
#define IFX_EMEM_TILESTATE_XCM2_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.XCM2 */
#define IFX_EMEM_TILESTATE_XCM2_OFF (20u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.XCM3 */
#define IFX_EMEM_TILESTATE_XCM3_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.XCM3 */
#define IFX_EMEM_TILESTATE_XCM3_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.XCM3 */
#define IFX_EMEM_TILESTATE_XCM3_OFF (22u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.XCM4 */
#define IFX_EMEM_TILESTATE_XCM4_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.XCM4 */
#define IFX_EMEM_TILESTATE_XCM4_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.XCM4 */
#define IFX_EMEM_TILESTATE_XCM4_OFF (24u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.XCM5 */
#define IFX_EMEM_TILESTATE_XCM5_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.XCM5 */
#define IFX_EMEM_TILESTATE_XCM5_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.XCM5 */
#define IFX_EMEM_TILESTATE_XCM5_OFF (26u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.XCM6 */
#define IFX_EMEM_TILESTATE_XCM6_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.XCM6 */
#define IFX_EMEM_TILESTATE_XCM6_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.XCM6 */
#define IFX_EMEM_TILESTATE_XCM6_OFF (28u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.XCM7 */
#define IFX_EMEM_TILESTATE_XCM7_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.XCM7 */
#define IFX_EMEM_TILESTATE_XCM7_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.XCM7 */
#define IFX_EMEM_TILESTATE_XCM7_OFF (30u)

/** \brief Length for Ifx_EMEM_SBRCTR_Bits.STBLOCK */
#define IFX_EMEM_SBRCTR_STBLOCK_LEN (1u)

/** \brief Mask for Ifx_EMEM_SBRCTR_Bits.STBLOCK */
#define IFX_EMEM_SBRCTR_STBLOCK_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_SBRCTR_Bits.STBLOCK */
#define IFX_EMEM_SBRCTR_STBLOCK_OFF (0u)

/** \brief Length for Ifx_EMEM_SBRCTR_Bits.STBULK */
#define IFX_EMEM_SBRCTR_STBULK_LEN (3u)

/** \brief Mask for Ifx_EMEM_SBRCTR_Bits.STBULK */
#define IFX_EMEM_SBRCTR_STBULK_MSK (0x7u)

/** \brief Offset for Ifx_EMEM_SBRCTR_Bits.STBULK */
#define IFX_EMEM_SBRCTR_STBULK_OFF (1u)

/** \brief Length for Ifx_EMEM_SBRCTR_Bits.STBSLK */
#define IFX_EMEM_SBRCTR_STBSLK_LEN (4u)

/** \brief Mask for Ifx_EMEM_SBRCTR_Bits.STBSLK */
#define IFX_EMEM_SBRCTR_STBSLK_MSK (0xfu)

/** \brief Offset for Ifx_EMEM_SBRCTR_Bits.STBSLK */
#define IFX_EMEM_SBRCTR_STBSLK_OFF (4u)

/** \brief Length for Ifx_EMEM_SBRCTR_Bits.STBPON */
#define IFX_EMEM_SBRCTR_STBPON_LEN (1u)

/** \brief Mask for Ifx_EMEM_SBRCTR_Bits.STBPON */
#define IFX_EMEM_SBRCTR_STBPON_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_SBRCTR_Bits.STBPON */
#define IFX_EMEM_SBRCTR_STBPON_OFF (16u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN0 */
#define IFX_EMEM_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN0 */
#define IFX_EMEM_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN0 */
#define IFX_EMEM_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN1 */
#define IFX_EMEM_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN1 */
#define IFX_EMEM_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN1 */
#define IFX_EMEM_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN2 */
#define IFX_EMEM_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN2 */
#define IFX_EMEM_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN2 */
#define IFX_EMEM_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN3 */
#define IFX_EMEM_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN3 */
#define IFX_EMEM_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN3 */
#define IFX_EMEM_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN4 */
#define IFX_EMEM_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN4 */
#define IFX_EMEM_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN4 */
#define IFX_EMEM_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN5 */
#define IFX_EMEM_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN5 */
#define IFX_EMEM_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN5 */
#define IFX_EMEM_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN6 */
#define IFX_EMEM_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN6 */
#define IFX_EMEM_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN6 */
#define IFX_EMEM_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN7 */
#define IFX_EMEM_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN7 */
#define IFX_EMEM_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN7 */
#define IFX_EMEM_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN8 */
#define IFX_EMEM_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN8 */
#define IFX_EMEM_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN8 */
#define IFX_EMEM_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN9 */
#define IFX_EMEM_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN9 */
#define IFX_EMEM_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN9 */
#define IFX_EMEM_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN10 */
#define IFX_EMEM_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN10 */
#define IFX_EMEM_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN10 */
#define IFX_EMEM_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN11 */
#define IFX_EMEM_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN11 */
#define IFX_EMEM_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN11 */
#define IFX_EMEM_ACCEN0_EN11_OFF (11u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN12 */
#define IFX_EMEM_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN12 */
#define IFX_EMEM_ACCEN0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN12 */
#define IFX_EMEM_ACCEN0_EN12_OFF (12u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN13 */
#define IFX_EMEM_ACCEN0_EN13_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN13 */
#define IFX_EMEM_ACCEN0_EN13_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN13 */
#define IFX_EMEM_ACCEN0_EN13_OFF (13u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN14 */
#define IFX_EMEM_ACCEN0_EN14_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN14 */
#define IFX_EMEM_ACCEN0_EN14_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN14 */
#define IFX_EMEM_ACCEN0_EN14_OFF (14u)

/** \brief Length for Ifx_EMEM_ACCEN0_Bits.EN15 */
#define IFX_EMEM_ACCEN0_EN15_LEN (1u)

/** \brief Mask for Ifx_EMEM_ACCEN0_Bits.EN15 */
#define IFX_EMEM_ACCEN0_EN15_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_ACCEN0_Bits.EN15 */
#define IFX_EMEM_ACCEN0_EN15_OFF (15u)

